In [2]:
import numpy as np
import pandas as pd

In [2]:
# 텍스트 데이터 다루기

In [3]:
# 텍스트 데이터: 규칙이 없음
# 데이터를 정리하는 과정: 랭글링(Wrangling) 또는 먼징(Munging)

In [3]:
inspections = pd.read_csv("C:/python/datas/chicago_food_inspections.csv")

In [5]:
inspections.Risk.value_counts()

Risk 1 (High)      107351
Risk 2 (Medium)     31845
Risk 3 (Low)        14529
All                    19
Name: Risk, dtype: int64

In [6]:
# 대소문자 변환과 공백 처리하기

In [7]:
inspections['Name']

0                 MARRIOT MARQUIS CHICAGO
1                                JETS PIZZA
2                                 ROOM 1520
3                  MARRIOT MARQUIS CHICAGO
4                              CHARTWELLS
                         ...
153805                           WOLCOTT'S
153806       DUNKIN DONUTS/BASKIN-ROBBINS
153807                             Cafe 608
153808                          mr.daniel's
153809                           TEMPO CAFE
Name: Name, Length: 153810, dtype: object

In [8]:
inspections['Name'].head().values

array([' MARRIOT MARQUIS CHICAGO   ', ' JETS PIZZA ', '   ROOM 1520 ',
       '  MARRIOT MARQUIS CHICAGO  ', ' CHARTWELLS   '], dtype=object)

In [9]:
# Series 객체의 str 속성

inspections['Name'].str

In [10]:
# strip 계열 메서드: 문자열의 공백을 제거

# lstrip() 메서드: left를 의미하며 왼쪽의 연속된 공백을 제거
# rstrip() 메서드: right를 의미하며 오른쪽의 연속된 공백을 제거
# strip() 메서드: 양쪽 끝의 연속된 공백을 제거

dessert = "  cheesecake  "
dessert.lstrip()

'cheesecake  '

In [11]:
dessert.rstrip()

'  cheesecake'

In [12]:
dessert.strip()

'cheesecake'

In [13]:
# Name 컬럼에 대해서만 strip 적용

inspections["Name"].str.lstrip().head(3)

0    MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
Name: Name, dtype: object

In [14]:
inspections["Name"].str.rstrip().head(3)

0     MARRIOT MARQUIS CHICAGO
1                  JETS PIZZA
2                   ROOM 1520
Name: Name, dtype: object

In [15]:
inspections["Name"].str.strip().head(3)

0    MARRIOT MARQUIS CHICAGO
1                 JETS PIZZA
2                  ROOM 1520
Name: Name, dtype: object

In [16]:
# 모든 컬럼에 대해서 동적으로 앞뒤 공백을 제거

inspections.columns

for column in inspections.columns:
    inspections[column] = inspections[column].str.strip()

In [17]:
# lower() 메서드: 모든 문자를 소문자로 변환
# upper() 메서드: 모든 문자를 대문자로 변환

In [18]:
inspections['Name'].str.lower().head()

0    marriot marquis chicago
1                 jets pizza
2                  room 1520
3    marriot marquis chicago
4                 chartwells
Name: Name, dtype: object

In [19]:
inspections['Name'].str.upper().head()

0    MARRIOT MARQUIS CHICAGO
1                 JETS PIZZA
2                  ROOM 1520
3    MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [20]:
# capitalize() 메서드: 문자열의 첫번째 문자만 대문자로 표시하고 나머지는 소문자로 표시
# title() 메서드는 각 단어 마다 첫 글자를 대문자로 나머지는 소문자로 표시

In [21]:
inspections['Name'].str.capitalize().head()

0    Marriot marquis chicago
1                 Jets pizza
2                  Room 1520
3    Marriot marquis chicago
4                 Chartwells
Name: Name, dtype: object

In [22]:
inspections['Name'].str.title().head()

0    Marriot Marquis Chicago
1                 Jets Pizza
2                  Room 1520
3    Marriot Marquis Chicago
4                 Chartwells
Name: Name, dtype: object

In [23]:
# 해당 Series의 고유한 값을 ndarray 형태로 반환

inspections['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
      dtype=object)

In [24]:
# Risk 컬럼의 모든 값을 일관된 형식으로 처리하기

In [25]:
# 결측치 제거

inspections = inspections.dropna(subset = ['Risk'])

In [26]:
# 결측치 제거가 제대로 이뤄졌는지 확인

inspections['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All'],
      dtype=object)

In [27]:
# replace() 메서드로 값 치환하기
# 첫 인수: to_replace로 검색할 값을 지정
# 두 번째 인수: value로 변경할 값 전달

# ‘All’ 문자열을 ‘Risk 4 (Extreme)”으로 치환
inspections = inspections.replace(
    to_replace = "All", value="Risk 4 (Extreme)"
)

In [28]:
inspections["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)',
       'Risk 4 (Extreme)'], dtype=object)

In [36]:
# StringMethods 객체에 인덱싱을 통해 하나의 문자를 추출

inspections['Risk'].str[5].astype('i').value_counts()

1    107351
2     31845
3     14529
4        19
Name: Risk, dtype: int64

In [7]:
# 문자열 슬라이싱
# 부분 문자열 추출

inspections['Risk'].str[8:-1].astype('category').head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: category
Categories (4, object): ['', 'High', 'Low', 'Medium']

In [39]:
# contains() 메서드
# 일치하는 문자열 필터링하기
# inspections 원본 데이터의 대소문자가 변경되지 않는다.

has_pizza = inspections['Name'].str.lower().str.contains('pizza')
inspections[has_pizza]

                                    Name             Risk
1                             JETS PIZZA  Risk 2 (Medium)
19         NANCY'S HOME OF STUFFED PIZZA    Risk 1 (High)
27            NARY'S GRILL & PIZZA ,INC.    Risk 1 (High)
29                   NARYS GRILL & PIZZA    Risk 1 (High)
68                         COLUTAS PIZZA    Risk 1 (High)
...                                  ...              ...
153756       ANGELO'S STUFFED PIZZA CORP    Risk 1 (High)
153764                COCHIAROS PIZZA #2    Risk 1 (High)
153772  FERNANDO'S MEXICAN GRILL & PIZZA    Risk 1 (High)
153788            REGGIO'S PIZZA EXPRESS    Risk 1 (High)
153801        State Street Pizza Company    Risk 1 (High)

[3992 rows x 2 columns]

In [43]:
# startswith() 메서드
# 특정 문자열로 시작되는 문자열 추출
# inspections 원본 데이터의 대소문자가 변경되지 않음

starts_with_tacos = (
    inspections['Name'].str.lower().str.startswith('tacos')
)
inspections[starts_with_tacos]

                         Name           Risk
69               TACOS NIETOS  Risk 1 (High)
556       TACOS EL TIO 2 INC.  Risk 1 (High)
675          TACOS DON GABINO  Risk 1 (High)
958       TACOS EL TIO 2 INC.  Risk 1 (High)
1036      TACOS EL TIO 2 INC.  Risk 1 (High)
...                       ...            ...
143587          TACOS DE LUNA  Risk 1 (High)
144026           TACOS GARCIA  Risk 1 (High)
146174        Tacos Place's 1  Risk 1 (High)
147810  TACOS MARIO'S LIMITED  Risk 1 (High)
151191            TACOS REYNA  Risk 1 (High)

[105 rows x 2 columns]

In [44]:
# endswith() 메서드

end_with_tacos = (
    inspections["Name"].str.lower().str.endswith("tacos")
)
inspections[end_with_tacos]

                   Name           Risk
382        LAZO'S TACOS  Risk 1 (High)
569        LAZO'S TACOS  Risk 1 (High)
2652       FLYING TACOS   Risk 3 (Low)
3250       JONY'S TACOS  Risk 1 (High)
3812       PACO'S TACOS  Risk 1 (High)
...                 ...            ...
151121      REYES TACOS  Risk 1 (High)
151318   EL MACHO TACOS  Risk 1 (High)
151801   EL MACHO TACOS  Risk 1 (High)
153087  RAYMOND'S TACOS  Risk 1 (High)
153504        MIS TACOS  Risk 1 (High)

[304 rows x 2 columns]